In [5]:
import numpy as np
import pandas as pd

In [6]:
n=np.nan

In [7]:
type(n)

float

In [8]:
m=1

In [9]:
m+n

nan

In [10]:
import string

In [11]:
s1 = pd.Series([1,2,np.nan,3,4],index=list(string.ascii_uppercase[:5]))
s1

A    1.0
B    2.0
C    NaN
D    3.0
E    4.0
dtype: float64

In [12]:
s1.fillna(2)

A    1.0
B    2.0
C    2.0
D    3.0
E    4.0
dtype: float64

In [13]:
s1.isnull()

A    False
B    False
C     True
D    False
E    False
dtype: bool

In [14]:
s1.notnull()

A     True
B     True
C    False
D     True
E     True
dtype: bool

In [17]:
s1.dropna()

A    1.0
B    2.0
D    3.0
E    4.0
dtype: float64

In [20]:
#dataframe
df=pd.DataFrame([[1,2,3],
            [np.nan,5,6],
             [7,np.nan,9],
             [np.nan,np.nan,np.nan]]
            )

In [21]:
df

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [22]:
df.isnull()

       0      1      2
0  False  False  False
1   True  False  False
2  False   True  False
3   True   True   True

In [29]:
df.dropna(axis=0,how='all')#默认是any，为all时全为nan才会删除

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [30]:
df.dropna(axis=0)

     0    1    2
0  1.0  2.0  3.0

In [31]:
df2=pd.DataFrame([[1,2,3,np.nan],
            [2,np.nan,5,6],
             [np.nan,7,np.nan,9],
             [1,np.nan,np.nan,np.nan]]
            )

In [32]:
df2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [34]:
df2.dropna(thresh=2)#操作thresh之后的数据

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [38]:
df2.fillna(value={0:1,1:5,2:8,3:9})#操作列

     0    1    2    3
0  1.0  2.0  3.0  9.0
1  2.0  5.0  5.0  6.0
2  1.0  7.0  8.0  9.0
3  1.0  5.0  8.0  9.0

In [39]:
df2.fillna(value=1)

     0    1    2    3
0  1.0  2.0  3.0  1.0
1  2.0  1.0  5.0  6.0
2  1.0  7.0  1.0  9.0
3  1.0  1.0  1.0  1.0